Revit 2026 API

# ThermalAssetCompressibility Property

---

The compressibility of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Compressibility { get; set; }
```
```vb
Public Property Compressibility As Double
	Get
	Set
```
```cpp
public:
property double Compressibility {
	double get ();
	void set (double value);
}
```
```fsharp
member Compressibility : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for compressibility is out of range |

Values must be in the range 0 to 1.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace